In [102]:
import pandas as pd
import yfinance as yf

# Currencies

In [103]:
# Obtener los datos de cotización para los símbolos especificados
eurusd = yf.download('EURUSD=X', start="2000-01-01", end="2024-01-01", period="1d")
jpyusd = yf.download('JPYUSD=X', start="2000-01-01", end="2024-01-01", period="1d")
gbpusd = yf.download('GBPUSD=X', start="2000-01-01", end="2024-01-01", period="1d")

[*********************100%%**********************]  1 of 1 completed

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

In [104]:
# Drop columns except 'Close' and rename 'Close' column
eurusd = eurusd[['Close']].rename(columns={'Close': 'eurusd'})
jpyusd = jpyusd[['Close']].rename(columns={'Close': 'jpyusd'})
gbpusd = gbpusd[['Close']].rename(columns={'Close': 'gbpusd'})

In [105]:
gbpusd

              gbpusd
Date
2003-12-01  1.718597
2003-12-02  1.730313
2003-12-03  1.728101
2003-12-04  1.720697
2003-12-05  1.733102
...              ...
2023-12-25  1.267700
2023-12-26  1.270487
2023-12-27  1.272718
2023-12-28  1.280082
2023-12-29  1.273399

[5223 rows x 1 columns]

In [106]:
currencies = [eurusd, jpyusd, gbpusd]

## Concat

# Indexes

In [107]:
nq = yf.download('NQ=F', start="2000-01-01", end="2024-01-01", period="1d")
sp500 = yf.download('^GSPC', start="2000-01-01", end="2024-01-01", period="1d")
nikkei = yf.download('^N225', start="2000-01-01", end="2024-01-01", period="1d")
ftse = yf.download('^FTSE', start="2000-01-01", end="2024-01-01", period="1d")

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

In [108]:
nq = nq[['Close']].rename(columns={'Close': 'nq'})
sp500 = sp500[['Close']].rename(columns={'Close': 'sp500'})
nikkei = nikkei[['Close']].rename(columns={'Close': 'nikkei'})
ftse = ftse[['Close']].rename(columns={'Close': 'ftse'})

In [109]:
indexes = [nq, sp500, nikkei, ftse]

In [110]:
df_indexes = pd.concat([nq, sp500, nikkei, ftse], axis=1, join='outer')

In [111]:
nq

                  nq
Date
2000-09-18   3653.50
2000-09-19   3804.00
2000-09-20   3853.00
2000-09-21   3765.00
2000-09-22   3776.00
...              ...
2023-12-22  16980.00
2023-12-26  17083.50
2023-12-27  17113.25
2023-12-28  17090.50
2023-12-29  17023.50

[5882 rows x 1 columns]

In [112]:
df_indexes

                  nq        sp500        nikkei         ftse
Date
2000-01-03       NaN  1455.219971           NaN          NaN
2000-01-04       NaN  1399.420044  19002.859375  6665.899902
2000-01-05       NaN  1402.109985  18542.550781  6535.899902
2000-01-06       NaN  1403.449951  18168.269531  6447.200195
2000-01-07       NaN  1441.469971  18193.410156  6504.799805
...              ...          ...           ...          ...
2023-12-25       NaN          NaN  33254.031250          NaN
2023-12-26  17083.50  4774.750000  33305.851562          NaN
2023-12-27  17113.25  4781.580078  33681.238281  7725.000000
2023-12-28  17090.50  4783.350098  33539.621094  7722.700195
2023-12-29  17023.50  4769.830078  33464.171875  7733.200195

[6240 rows x 4 columns]

## Concat

In [113]:
df_currencies = pd.concat([eurusd, jpyusd, gbpusd], axis=1)

In [114]:
df_currencies

              eurusd    jpyusd    gbpusd
Date
2000-01-03       NaN  0.009834       NaN
2000-01-04       NaN  0.009696       NaN
2000-01-05       NaN  0.009607       NaN
2000-01-06       NaN  0.009503       NaN
2000-01-07       NaN  0.009494       NaN
...              ...       ...       ...
2023-12-25  1.102657  0.007025  1.267700
2023-12-26  1.102026  0.007031  1.270487
2023-12-27  1.104301  0.007019  1.272718
2023-12-28  1.110864  0.007072  1.280082
2023-12-29  1.106819  0.007071  1.273399

[6248 rows x 3 columns]

# Concat

In [115]:
df_stocks = pd.concat([df_currencies, df_indexes], axis=1).ffill()

In [116]:
df_stocks

,eurusd,jpyusd,gbpusd,nq,sp500,nikkei,ftse
Date,,,,,,,
2000-01-03,NaN,0.009834,NaN,NaN,1455.219971,NaN,NaN
2000-01-04,NaN,0.009696,NaN,NaN,1399.420044,19002.859375,6665.899902
2000-01-05,NaN,0.009607,NaN,NaN,1402.109985,18542.550781,6535.899902
2000-01-06,NaN,0.009503,NaN,NaN,1403.449951,18168.269531,6447.200195
2000-01-07,NaN,0.009494,NaN,NaN,1441.469971,18193.410156,6504.799805
...,...,...,...,...,...,...,...
2023-12-25,1.102657,0.007025,1.267700,16980.00,4754.629883,33254.031250,7697.500000
2023-12-26,1.102026,0.007031,1.270487,17083.50,4774.750000,33305.851562,7697.500000
2023-12-27,1.104301,0.007019,1.272718,17113.25,4781.580078,33681.238281,7725.000000
2023-12-28,1.110864,0.007072,1.280082,17090.50,4783.350098,33539.621094,7722.700195
2023-12-29,1.106819,0.007071,1.273399,17023.50,4769.830078,33464.171875,7733.200195

In [117]:
df_stocks.isna().sum()

eurusd    1020
jpyusd       0
gbpusd    1020
nq         185
sp500        0
nikkei       1
ftse         1
dtype: int64

In [118]:
# Keep only the observations after 2004
df_stocks = df_stocks[(df_stocks.index >= '2004-01-01') & (df_stocks.index < '2023-01-01')]

In [119]:
df_stocks

,eurusd,jpyusd,gbpusd,nq,sp500,nikkei,ftse
Date,,,,,,,
2004-01-01,1.258194,0.009320,1.785204,1468.00,1111.920044,10676.639648,4476.899902
2004-01-02,1.258194,0.009354,1.793690,1466.50,1108.479980,10676.639648,4510.200195
2004-01-05,1.268698,0.009413,1.807207,1495.50,1122.219971,10825.169922,4513.299805
2004-01-06,1.272103,0.009414,1.821295,1504.50,1123.670044,10813.990234,4505.200195
2004-01-07,1.264095,0.009418,1.817785,1517.00,1126.329956,10757.820312,4473.000000
...,...,...,...,...,...,...,...
2022-12-26,1.066780,0.007531,1.206001,11075.25,3844.820068,26405.869141,7473.000000
2022-12-27,1.064022,0.007532,1.208415,10915.50,3829.250000,26447.869141,7473.000000
2022-12-28,1.063717,0.007491,1.202733,10772.75,3783.219971,26340.500000,7497.200195
2022-12-29,1.062925,0.007461,1.202848,11032.75,3849.280029,26093.669922,7512.700195
2022-12-30,1.066075,0.007524,1.205633,11022.25,3839.500000,26094.500000,7451.700195

In [120]:
df_stocks.isnull().sum()

eurusd    0
jpyusd    0
gbpusd    0
nq        0
sp500     0
nikkei    0
ftse      0
dtype: int64

# Gen csv

In [44]:
#df_stocks.to_csv('../../data/preparation/currencies_stocks.csv')